resources/help/demand-models.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Demand modelling method</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Demand modelling method</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org513f075">1. Heat demand model</a>
<ul>
<li><a href="#annual-demand-model">1.1. Annual demand model</a>
<ul>
<li><a href="#org2756d7c">1.1.1. Algorithm</a></li>
<li><a href="#org95359a4">1.1.2. Model creation</a></li>
<li><a href="#org041f1d6">1.1.3. Model validation</a></li>
<li><a href="#orga309da7">1.1.4. Predictors</a></li>
</ul>
</li>
<li><a href="#peak-demand-model">1.2. Peak demand model</a></li>
</ul>
</li>
<li><a href="#orgf2651c7">2. Cooling demand model</a>
<ul>
<li><a href="#org87b5272">2.1. Annual demand model</a></li>
<li><a href="#org3d34d24">2.2. Peak demand model</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>NOTE:</b> This document is not yet complete.
</p>

<div id="outline-container-org513f075" class="outline-2">
<h2 id="org513f075"><span class="section-number-2">1</span> Heat demand model</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org667540a" class="outline-3">
<h3 id="annual-demand-model"><span class="section-number-3">1.1</span> Annual demand model</h3>
<div class="outline-text-3" id="text-annual-demand-model">
<p>
Annual demand is predicted using a combination of several models:
</p>

<ul class="org-ul">
<li>A support vector machine (SVM) trained on predictors that use the three-dimensional shape of a building</li>
<li>A linear model (LM) trained on predictors that use the three-dimensional shape of a building</li>
<li>A SVM trained on two-dimensional predictors only</li>
<li>A LM trained on two-dimensional predictors only</li>
<li>A separate hot water demand model</li>
</ul>
</div>

<div id="outline-container-org2756d7c" class="outline-4">
<h4 id="org2756d7c"><span class="section-number-4">1.1.1</span> Algorithm</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
If there is three-dimensional data available, then the 3D predictors are calculated and the 3D models are used, otherwise the 2D versions are used. The predictors are given later; following this the process is
</p>

<dl class="org-dl">
<dt>Estimate space heat demand</dt><dd><ol class="org-ol">
<li>Estimate normalized space heat demand with SVM; for most buildings this will produce a good result, but for buildings which are extreme cases with regard to one of the predictors the SVM kernel's smoothing behaviour will prevent extrapolation.</li>

<li>If the predictors are out of range for the SVM, use the LM instead</li>

<li><p>
If the LM produces a bad result (<i>because</i> it extrapolates), go back to the SVM.
</p>

<p>
A bad result is one where the space demand figure is clearly too low
</p></li>
<li><p>
De-normalize the demand; the SVM and LM both predict space heat demand <i>per square root heating degree day</i>, so we multiply the space heat demand result by the square root of the number of heating degree days in the location.
</p>

<p>
This is following the methodology in Ecoheatcool's work package 1<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p></li>
</ol></dd>
<dt>Estimate hot water demand</dt><dd>For this we use the methodology from SAP 2012<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, equations (42)-(45). This method is essentially a nonlinear benchmark, as the demand is derived from the building's assumed floor area.</dd>
</dl>
</div>
</div>

<div id="outline-container-org95359a4" class="outline-4">
<h4 id="org95359a4"><span class="section-number-4">1.1.2</span> Model creation</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<b>NOTE:</b> This is incomplete.
</p>

<p>
The model is based on measured heat demand data from buildings in Copenhagen; for these buildings we computed both the 3D and 2D predictors described below, and used an R machine learning toolkit to train and cross-validate SVM and LMs to predict space heat demand per square root degree-day using each set of predictors.
</p>

<p>
To separate space heat demand from hot water demand in the training data, we applied a simple assumption that a constant proportion related space heat to hot water demand. It would perhaps have been more consistent to estimate hot water demand using the SAP equations, and subtract that value.
</p>
</div>
</div>

<div id="outline-container-org041f1d6" class="outline-4">
<h4 id="org041f1d6"><span class="section-number-4">1.1.3</span> Model validation</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<b>*NOTE:</b> This is incomplete.
</p>
</div>

<ol class="org-ol">
<li><a id="org3c7892b"></a>Cross-validation<br /></li>

<li><a id="org0ce0d98"></a>Validation on aggregate datasets<br /></li>
</ol>
</div>

<div id="outline-container-orga309da7" class="outline-4">
<h4 id="orga309da7"><span class="section-number-4">1.1.4</span> Predictors</h4>
<div class="outline-text-4" id="text-1-1-4">
<dl class="org-dl">
<dt>Three-dimensional predictors</dt><dd><ul class="org-ul">
<li><i>External</i> wall area, computed by taking the length of all walls not shared with adjacent buildings and multiplying it by the building height</li>
<li>Height, computed by sampling LIDAR points within the building's footprint polygon</li>
<li>Perimeter, which is just the perimeter of the footprint polygon</li>
<li>Surface per volume, which is the ratio of the building's overall surface area (including party area) to its volume</li>
<li>Volume, which is the footprint area multiplied by height</li>
</ul></dd>
<dt>Two-dimensional predictors</dt><dd><ul class="org-ul">
<li>Footprint area</li>
<li>Perimeter</li>
<li>Perimeter divided by footprint</li>
<li>Whether the building is residential or not</li>
<li>Party perimeter, as a proportion</li>
<li>Party perimeter, as an absolute value in metres</li>
</ul></dd>
<dt>SAP predictors</dt><dd><ul class="org-ul">
<li>Floor area, estimated using building height and an assumed storey height to get a number of floors, or assuming a single floor if no height is known. 
This has some room for improvement; for example predicting floor area from the two dimensional predictors and other building attributes might be worthwhile.</li>
</ul></dd>
</dl>

<p>
Other geometric predictors which might be worth considering would include functions of building orientation (e.g. south-facing area), and the number of corners or edges on the building, but we have not assessed these. We have also not explored any further categorical information about buildings, or information about their occupancy. Whilst these features might improve the predictive power, they are harder to come by and so reduce the number of places the model can be applied.
</p>
</div>
</div>
</div>

<div id="outline-container-orge1a90a1" class="outline-3">
<h3 id="peak-demand-model"><span class="section-number-3">1.2</span> Peak demand model</h3>
<div class="outline-text-3" id="text-peak-demand-model">
<p>
The peak demand in kW \(p\) is derived as a function of the annual demand in kWh \(a\), using the rule:
</p>

<p>
\[
p = 21.84 + 0.0004963 \times a
\]
</p>

<p>
This rule is derived from analysis of smart meter data in the UK, relating peak to annual gas usage, with some assumed efficiencies and weather correction.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2651c7" class="outline-2">
<h2 id="orgf2651c7"><span class="section-number-2">2</span> Cooling demand model</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org87b5272" class="outline-3">
<h3 id="org87b5272"><span class="section-number-3">2.1</span> Annual demand model</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Cooling demand is estimated using the method given by Sven Werner in <i>European space cooling demands</i>, published in Elsevier's <i>Energy</i> 110 (2016) pp148 &#x2013; 156<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.
</p>

<p>
The model uses an empirically determined <i>cooling index</i> \(E\), which is used to produce a benchmark value of \(1.22 \times E - 43.5\) kWh/m<sup>2</sup>.
</p>

<p>
The cooling index varies by region, and so incorporates some evidence about the cooling degree days that are needed.
</p>
</div>
</div>
<div id="outline-container-org3d34d24" class="outline-3">
<h3 id="org3d34d24"><span class="section-number-3">2.2</span> Peak demand model</h3>
<div class="outline-text-3" id="text-2-2">
<p>
At the moment the cooling peak model is very basic. 
The BSRIA <i>Rules of thumb</i> (5<sup>th</sup> edition)<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> gives the following indicative values for cooling capacity <i>in the UK</i> by building use:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Use</th>
<th scope="col" class="org-right">W/m<sup>2</sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Residential</td>
<td class="org-right">70</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Offices</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-left">Hotels and shops</td>
<td class="org-right">150</td>
</tr>

<tr>
<td class="org-left">Restaurants</td>
<td class="org-right">200</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Datacenters</td>
<td class="org-right">1500</td>
</tr>
</tbody>
</table>

<p>
Since THERMOS doesn't usually know more than whether a building is residential or not, we have taken as representative two values: 70 W/m<sup>2</sup> for residential, and 150 W/m<sup>2</sup> for non-residential buildings.
</p>

<p>
To translate these values to regions other than the UK, we have related them to Werner's annual demand model to produce ratios between annual demand and peak demand for residential and non-residential buildings.
</p>

<p>
The peak demand is then calculated by applying this ratio to the annual demand estimate from Werner's method. The assumption here is that the peak-to-base ratio is the same in different regions.
</p>

<p>
We would be very interested to hear from anyone with a better idea or more evidence about this part.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
ECOHEATCOOL, Work Package 1; the European Heat Market (Final Report), by Euroheat &amp; Power, 2005-2006.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.bre.co.uk/filelibrary/SAP/2012/SAP-2012_9-92.pdf">SAP 2012</a>, the Government's Standard Assessment Procedure for Energy Rating of Dwellings
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Available from <a href="https://ideas.repec.org/a/eee/energy/v110y2016icp148-156.html">https://ideas.repec.org/a/eee/energy/v110y2016icp148-156.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
ISBN 978 0 86022 692 5
</p></div></div>


</div>
</div></div>
</body>
</html>
